R.org
* Control Files

Remember to link these from =~/= to here. Automate it.

The goal here is to get R set up thoughtfully and quickly. The profile
and environ set it up correctly. Always remember this and run R using those
configuration files.

When R starts, it won't find any of the required packages. It will complain a
lot. That is OK. Just keep running the install script until it is happy
=source("~/.Rinstall")=. Then restart R and everything should be fine.

Many things happen during this package installation process. Some are R specific
and some have to do with the machine that you are running on. Both are
mentioned here:

- Check the version that is running
- Go back and read the transcript and make sure that it looks right
- Eventually that script will fail, for example
  - there is no package called ‘devtools’
    - Called =install.packages("devtools")= manually
    - Install order error
- After running it a couple of times, it is finished

My old config started R without the init-file. That was dumb. It created a lot
of needless hassle without any significant benefit.

*.Rprofile*
#+begin_src R :tangle .Rprofile :comments no
## -*- mode: R; -*-
«rprofile-def»
.First <- function() {
    gcr <- new.env()
    «rfirst-defs»
    base::attach(gcr, name="gcr", warn.conflicts=FALSE)
}
fortune()
#+end_src

*.Renviron*
#+begin_src sh :tangle .Renviron :comments no
# -*- mode: sh; -*-
«renviron-def»
#+end_src

*.Rinstall*
#+begin_src sh :tangle .Rinstall :comments no
# -*- mode: R; -*-
«rinstall-def»
#+end_src

** .Rprofile [fn:89a51cf1: https://stackoverflow.com/questions/1189759/expert-r-users-whats-in-your-rprofile]
      :PROPERTIES:
      :noweb-ref: rprofile-def
      :END:

- When you install packages, R needs to know which repository it should use. If
  you don't tell it, then it will ask you every time. It is just doing its job.
  Make it easier for yourself and specify a repo for once and for all.
  - Via [fn:41269bb7: http://www.r-bloggers.com/installing-r-packages/]
  - Built-in docs explain that =local= should be used here
  - This could also be a one-liner: ~options("repos" = c(CRAN = "http://cran.r-project.org/"))~
#+begin_src R
local({
    r = getOption("repos")
    r["CRAN"] = "http://cran.r-project.org/"
    options(repos = r)
})
#+end_src

- By default, hitting enter in the =browser= will submit a =c= for "continue
  execution at the next statement"
  - It is too easy to hit enter when you didn't mean it
  - It just /feels/ imprecise
  - Never let this happen, disable that feature
#+begin_src R
options(browserNLdisabled = TRUE)
#+end_src

Show timestamps to 3 sub-seconds:
#+begin_src R
options("digits.secs"=3)
#+end_src

Do not allow automatic coercion of strings into factors, as you can specify this
by argument to make it /real/ obvious. Looks like the best way is to leave it
alone globally and always do it by hand though. hwickam commented that it is
bad, bad idea to make this option global not because of your code, but because
of everyone else's that you are using which relies on the option being set to
=TRUE=.
#+begin_src R
options(stringsAsFactors=TRUE)
#+end_src

This might be /too much/, but always show a call stack when *any* warnings or
errors occur
#+begin_src R
options(showWarnCalls=TRUE)
options(showErrorCalls=TRUE)
#+end_src

Be highly conservative about errors and warnings: handle the former immediately
and cause the latter to be errors. However, only do this after your workspace
has initialized correctly. Do so too soon and most things won't work because
this approach is only to handle /my/ issues. Imagine of the whole work just
handled their own issues! Anway, the safe values are set here, leave them alone.
Making them more aggressive will break your startup. When you are ready to set
things to be more aggressive, turn it on yourself
#+begin_src R
options(error=NULL)
options(warn=0)
#+end_src

Don't print more than 500 lines. If you can grok more than 500 lines then please
teach me. Be at ease, there is a helper to remove that restriction, just in case.
#+begin_src R
options(max.print=500)
#+end_src

Partial matching is a neat and flexible feature for objects. In theory, it is
quite powerful and convenient. In practice it seems like a really bad idea to
me. It is a /personal preference/. It only makes sense from that perspective.
This could bork 3rd party code.
#+begin_src R
options(warnPartialMatchDollar = TRUE)
#+end_src

Locale:
- Make sure that the language is set correctly. I couldn't find anything specific
  about setting it this way other than various posts. In practice you would really
  put all of this in your system environment configuration, but I'm wanting to be
  a little more particular here because it affects operations on data structures,
  in particular sorting.
- Error messages are mostly useful when they are displayed in English, so make
  sure that the locale is always English [fn:24499ef7:    http://cran.r-project.org/doc/manuals/r-patched/R-admin.html#Localization-of-messages].
  "Note that the LANGUAGE environment variable has precedence over ~LC_MESSAGES~ in
  selecting the language for message translation on most R platforms." [fn:51fe4215: http://stat.ethz.ch/R-manual/R-devel/library/base/html/locales.html]
- Note:
  - My previous approach was to define a top level binding for the locale string
    and pass that reference to bind each of the following settings. That was fine
    until I wanted to be able to easily clear out all of the top-level bindngs to
    "reset" it with a =rm(ls())= kind of thing. For that reason, I just use the
    manifest strings here.
#+begin_src R
Sys.setenv(LANG = "en_US.UTF-8")
Sys.setlocale("LC_COLLATE", "en_US.UTF-8")
Sys.setlocale("LC_MESSAGES", "en_US.UTF-8")
#+end_src

*** Packages

<2014-11-14 Fri>
Below is a try to auto-install packages if they are not available, and, it seems
to have failed. Perhaps there is a better way, and I do need to find it. Until
then I will install as-needed. As such, I suppose that I've found it.

**** assertthat

Design-by-contract  [fn:bc0c6d68: http://cran.r-project.org/web/packages/assertthat/index.html
] is a great, great thing. Make it much easier with valuable
functionsand useful messages!

Cheatsheet:
- Always use ~assert_that~
- Use
  - ℝ built ins to check tests
  - Additionally via =assertthat=:
    - =is.flag=
    - =is.string=
    - =has_name=
    - =has_attr=
    - =is.count=
    - =are_equal=
    - =not_empty=
    - =noNA=
    - =is.dir=
    - =is.writeable= and =is.readable=
    - =has_extension=

#+begin_src R
library(assertthat)
#+end_src

#+begin_src R :noweb-ref rinstall-def
if(! require(assertthat)){
    install.packages("assertthat")
}
#+end_src

**** testthat

Design-by-contract and unit-tests [fn:d61c81a6: http://cran.r-project.org/web/packages/testthat/index.html]
go hand-in-hand.

Expectations:
- =equals() :=: uses =all.equal()= to check for equality with numerical tolerance
  - Shorthand: =expect_equal(x, y)=
- =is_identical_to()= :: uses =identical()= to check for exact equality
  - Shorthand: =expect_identical(x, y)=
- =is_equivalent_to()= :: is a more relaxed version of =equals()= that ignores attributes
  - Shorthand: =expect_equivalent(x, y)=
- =is_a()= :: checks that an object =inherit()='s from a specified class
  - Shorthand: =expect_is(x, y)=
- =matches()= :: matches a character vector against a regular expression.
  - The optional all argument controls where all elements or just one element
    need to match.
  - Shorthand: =expect_matches(x, y)=
- =prints_text()= :: matches the printed output from an expression against a
  regular expression
  - Shorthand: =expect_output(x, y)=
- =shows_message()= :: checks that an expression shows a message
  - Shorthand: =expect_message(x, y)=
- =gives_warning()= :: expects that you get a warning
  - Shorthand: =expect_warning(x, y)=
- =throws_error()= :: verifies that the expression throws an error.
  - You can also supply a regular expression which is applied to the text of the
    error
  - Shorthand: =expect_error(x, y)=
- =is_true()= :: is a useful catchall if none of the other expectations do what
  you want - it checks that an expression is true
  - =is_false()= is the complement of =is_true()=
  - Shorthand: =expect_true(x)=
  - Shorthand: =expect_false(x)=

- Notes
  - "Each test is run in its own environment so it is self-contained."
    - Plain old code so you can modify the global environment FYI

#+begin_src R
library(testthat)
#+end_src

#+begin_src R :noweb-ref rinstall-def
if(! require(testthat)) {
    install.packages("testthat")
}
#+end_src

**** stringr

Make it really easy to work with strings [fn:bb2c9d86: http://cran.r-project.org/web/packages/stringr/index.html]. That is indeed a good goal, and
the reason that I installed this initially was because =testthat= mentions that
it is used.
#+begin_src R
library(stringr)
#+end_src

#+begin_src R :noweb-ref rinstall-def
if(! require(stringr)) {
    install.packages("stringr")
}
#+end_src

