.Rprofile

## [[file:~/git/bitbucket-grettke/home/TC3F.org::*Control%20Files][Control\ Files:1]]

## [[file:~/git/bitbucket-grettke/home/TC3F.org::*.Rprofile%20%5Bfn:89a51cf1:%20https://stackoverflow.com/questions/1189759/expert-r-users-whats-in-your-rprofile%5D][nil]]
local({
    r = getOption("repos")
    r["CRAN"] = "http://cran.r-project.org/"
    options(repos = r)
})
## nil ends here
## [[file:~/git/bitbucket-grettke/home/TC3F.org::*.Rprofile%20%5Bfn:89a51cf1:%20https://stackoverflow.com/questions/1189759/expert-r-users-whats-in-your-rprofile%5D][nil]]
options(browserNLdisabled = TRUE)
## nil ends here
## [[file:~/git/bitbucket-grettke/home/TC3F.org::*.Rprofile%20%5Bfn:89a51cf1:%20https://stackoverflow.com/questions/1189759/expert-r-users-whats-in-your-rprofile%5D][nil]]
options("digits.secs"=3)
## nil ends here
## [[file:~/git/bitbucket-grettke/home/TC3F.org::*.Rprofile%20%5Bfn:89a51cf1:%20https://stackoverflow.com/questions/1189759/expert-r-users-whats-in-your-rprofile%5D][nil]]
options(prompt="â„> ")
## nil ends here
## [[file:~/git/bitbucket-grettke/home/TC3F.org::*.Rprofile%20%5Bfn:89a51cf1:%20https://stackoverflow.com/questions/1189759/expert-r-users-whats-in-your-rprofile%5D][nil]]
options(stringsAsFactors=TRUE)
## nil ends here
## [[file:~/git/bitbucket-grettke/home/TC3F.org::*.Rprofile%20%5Bfn:89a51cf1:%20https://stackoverflow.com/questions/1189759/expert-r-users-whats-in-your-rprofile%5D][nil]]
options(showWarnCalls=TRUE)
options(showErrorCalls=TRUE)
## nil ends here
## [[file:~/git/bitbucket-grettke/home/TC3F.org::*.Rprofile%20%5Bfn:89a51cf1:%20https://stackoverflow.com/questions/1189759/expert-r-users-whats-in-your-rprofile%5D][nil]]
options(error=NULL)
options(warn=0)
## nil ends here
## [[file:~/git/bitbucket-grettke/home/TC3F.org::*.Rprofile%20%5Bfn:89a51cf1:%20https://stackoverflow.com/questions/1189759/expert-r-users-whats-in-your-rprofile%5D][nil]]
options(max.print=500)
## nil ends here
## [[file:~/git/bitbucket-grettke/home/TC3F.org::*.Rprofile%20%5Bfn:89a51cf1:%20https://stackoverflow.com/questions/1189759/expert-r-users-whats-in-your-rprofile%5D][nil]]
options(warnPartialMatchDollar = TRUE)
## nil ends here
## [[file:~/git/bitbucket-grettke/home/TC3F.org::*.Rprofile%20%5Bfn:89a51cf1:%20https://stackoverflow.com/questions/1189759/expert-r-users-whats-in-your-rprofile%5D][nil]]
Sys.setenv(LANG = "en_US.UTF-8")
Sys.setlocale("LC_COLLATE", "en_US.UTF-8")
Sys.setlocale("LC_MESSAGES", "en_US.UTF-8")
## nil ends here
## [[file:~/git/bitbucket-grettke/home/TC3F.org::*assertthat][nil]]
library(assertthat)
## nil ends here
## [[file:~/git/bitbucket-grettke/home/TC3F.org::*testthat][nil]]
library(testthat)
## nil ends here
## [[file:~/git/bitbucket-grettke/home/TC3F.org::*stringr][nil]]
library(stringr)
