R.org
**** sqldf

How you extract data from a dataframe is flexible and everyone can and may do it
differently. One option available is to use =SQL= [fn:2e49b888: http://cran.r-project.org/web/packages/sqldf/index.html], so make it available.

Comments taken from [fn:c116c9a5: http://randyzwitch.com/sqldf-package-r/]
- "This [using SQL] is a skill that every analyst should possess"
- "Being able to write SQL will save you time and provide you with a way of
  getting repeatable results so that you don't have to focus on doing the
  calculations all the time and worrying about errors in Excel"
- "[instead] You can focus on the task of actually analyzing your data"

Notes from the user manual [fn:0ef50a78: http://cran.r-project.org/web/packages/sqldf/index.html]
- Interesting package info
  - "Title Perform SQL Selects on R Data Frames"
  - "Author G. Grothendieck <ggrothendieck@gmail.com>"
  - "Description Description: Manipulate R data frames using SQL."
  - "Depends R (>= 2.14.0), gsubfn (>= 0.6), proto, RSQLite (>= 0.8-0),RSQLite.extfuns"
- Google group mentioned [fn:0bf2d03a: https://groups.google.com/forum/#!forum/sqldf], joined it
- Official site mentioned and it has good docs
- Seems to uses SQLLite
- =read.csv.sql=
  - "Read a file into R filtering it with an sql statement. Only the filtered
    portion is processed by R so that files larger than R can otherwise handle
    can be accommodated."
  - Parms
    - Handles =http= and =ftp= =URLs=
    - =filter=
      - "If specified, this should be a shell/batch command that the input file is
        piped through. For read.csv2.sql it is by default the following on
        non-Windows systems: tr , .. This translates all commas in the file to
        dots."
        - Why is that specific example mentioned?
    - =field.types=
      - State the SQLite types for the column names
      - Rarely needed
    - =dbname=
      - "As in =sqldf= except that the default is =tempfile()=. Specifying =NULL= will
        put the database in memory which may improve speed but will limit the size
        of the database by the available memory."
  - Details
    - "Reads the indicated file into an sql database creating the database if it
      does not already exist. Then it applies the sql statement returning the
      result as a data frame. If the database did not exist prior to this
      statement it is removed."
    - "Note that it uses facilities of SQLite to read the file which are
      intended for speed and therefore not as flexible as in R. For example, it
      does not recognize quoted fields as special but will regard the quotes as
      part of the field. See the sqldf help for more information."
    - "=read.csv2.sql= is like =read.csv.sql= except the default sep is ";" and the
      default filter translates all commas in the file to decimal points (i.e.
      to dots)."
  - Value
    - "If the sql statement is a select statement then a data frame is returned."
- =sqldf=
  - Description :: SQL select on data frames
  - Arguments
    - =stringsAsFactors does what you think
    - =row.names= could be useful
    - =envir= could make it safer
    - =method= determines how to type the data from the database into a dataframe
      - Looks like a *powerhouse* feature
      - Could greatly simplify data brokering
    - =file.format=
      - =eol= handling mentioned across platforms
      - Ran into this with the built-in reader
    - =dbname=
      - SQLite creates an in-memory database!
  - Details
    - The typical action of sqldf is to
    - create a database :: in memory
    - read in the data frames and files :: used in the select statement. This is
      done by scanning the select statement to see which words in the select
      statement are of class "data.frame" or "file" in the parent frame, or the
      specified environment if envir is used, and for each object found by
      reading it into the database if it is a data frame. Note that this
      heuristic usually reads in the wanted data frames and files but on
      occasion may harmlessly reads in extra ones too.
    - run the select statement :: getting the result as a data frame
    - assign the classes :: of the returned data frame’s columns if
      method = "auto". This is done by checking all the column names in the
      read-in data frames and if any are the same as a column output from the
      data base then that column is coerced to the class of the column whose
      name matched. If the class of the column is "factor" or "ordered" or if
      the column is not matched then the column is returned as is. If
      method = "auto.factor" then processing is similar except that "factor"
      and "ordered" classes and their levels will be assigned as well. The
      "auto.factor" heuristic is less reliable than the "auto" heuristic. If
      method = "raw" then the classes are returned as is from the database.
    - cleanup :: If the database was created by sqldf then it is deleted;
      otherwise, all tables that were created are dropped in order to leave the
      database in the same state that it was before. The database connection is
      terminated.
    - Warning :: Although sqldf is usually used with on-the-fly databases which
      it automatically sets up and destroys if you wish to use it with existing
      databases be sure to back up your database prior to using it since
      incorrect operation could destroy the entire database.
  - Value
    - The result of the specified select statement is output as a data frame.
    - If a vector of sql statements is given as x then the result of the last
      one is returned.
    - If the x and connection arguments are missing then it returns a new
      connection and also places this connection in the option sqldf.connection.
      - Great to know that the connection is cached!
  - Notes
    - Big FYI: Commas in columns will be parsed as column separators!
      - Recommends using =read.table= if this matter
  - Examples
    - They all demonstrate how to do it in R and then again with SQL
    - Super helpful
    - You seem to be able to do everything that you would expect possible
  - Thoughts
    - Need to grok both R and SQL to use this safely
    - Using temp tables is kind of huge
    - Via [fn:55ef7537: https://stackoverflow.com/questions/19019883/how-to-handle-column-names-not-supported-by-sqldf-in-r]
      - Use =_= instead lf =.= in column names from a R call
        - Where is this in the documentation?

Notes from the official site [fn:078aba0c: https://code.google.com/p/sqldf/]
- Opening
  - How it works
    - The user simply specifies an SQL statement
    - in R using data frame names in place of table names
    - and a database with appropriate table layouts/schema is automatically
      created,
    - the data frames are automatically loaded into the database,
    - the specified SQL statement is performed,
    - the result is read back into R
    - and the database is deleted all automatically behind the scenes making the
      database's existence transparent to the user who only specifies the SQL
      statement.
  - Supports
    - SQLite
    - H2
    - PostgreSQL
    - MySQL
  - The FAQ mostly talks about SQLite
- Overview
  - with sqldf the user is freed from having to do the following, all of which
    are automatically done:
    - database setup
    - writing the create table statement which defines each table
    - importing and exporting to and from the database
    - coercing of the returned columns to the appropriate class in common cases
  - It an be used for
    - learning R if you know SQL
    - Doing it faster than R
    - Load portions of a really large file
- Troubleshooting
  - Set the driver expicitly
  - "error messages regarding a data frame that has a dot in its name. The dot
    is an SQL operator. Either quote the name appropriately or change the name
    of the data frame to one without a dot."
- FAQ
  - Column class conversion touched upon
  - Dots in names
    - Dots are SQL operators so can't use them
      - See =?SQL92Keywords=
    - For columns
      - Either use underscore
      - Or simply remove them
    - For tables
      - Double quote the name
  - H2 supports date types, which seems quite helpful
  - Name a column ending with two underscores and a type and the library will
    convert the type to R correctly
    - Mentioned in the docs
  - SQL is case *insensitive*
    - Don't rely on casing to differentiate column names
  - We may examine the in-memory database table structure
  - Be quite careful about CSV data that contains commas again as this lib
    won't handle it
  - Good examples of cleaning data gettig int into a R friendly format
  - Be sure to specify numeric values as integers or doubles so you get expected
    results from division
- Examples
  - Example 1. Ordering and Limiting
  - Example 2. Averaging and Grouping
  - Example 3. Nested Select
  - Example 4. Join
  - Example 5. Insert Variables
    - Hugely convenient
  - Example 6. File Input
  - Example 7. Nested Select
  - Example 8. Specifying File Format
  - Example 9. Working with Databases
  - Example 10. Persistent Connections
  - Example 11. Between and Alternatives
  - Example 12. Combine two files in permanent database
  - Example 13. read.csv.sql and read.csv2.sql
    - Uses SQLite's import facility to create an in-memory database
    - Then it reads the results of the query into R
    - The import does not involve R so it can handle larger files than R can
      assuming that the query results in a size that does fit
  - Example 14. Use of spatialite library functions
  - Example 15. Use of RSQLite.extfuns library functions
  - Example 16. Moving Average

SQLite, SQL As Understood By SQLite:
- [[https://www.sqlite.org/lang_corefunc.html][Core Functions]]
- [[https://www.sqlite.org/lang_aggfunc.html][Aggregate Functions]]
- [[https://www.sqlite.org/lang_datefunc.html][Date And Time Functions]]
- These previous are all provided by [[http://cran.r-project.org/web/packages/RSQLite.extfuns/index.html][RSQLite.extfuns]]

#+begin_src R
library(sqldf)
#+end_src

#+begin_src R :noweb-ref rinstall-def
if(! require(sqldf)) {
    install.packages("sqldf")
}
#+end_src

**** MASS

"Functions and datasets to support Venables and Ripley, 'Modern Applied
Statistics with S' (4th edition, 2002)." Also, =sqldf= recommended it be
installed, so it is the right time. [fn:4d284c54: http://cran.r-project.org/web/packages/MASS/index.html]

#+begin_src R
library(MASS)
#+end_src

#+begin_src R :noweb-ref rinstall-def
if(! require(MASS)) {
    install.packages("MASS")
}
#+end_src

**** jsonlite

Make it easy to work with JSON [37138455: http://cran.r-project.org/web/packages/jsonlite/index.html].
Reading the vignette's, it does a lot more, for example =rbind.pages=.

#+begin_src R
library(jsonlite)
#+end_src

#+begin_src R :noweb-ref rinstall-def
if(! require(jsonlite)) {
    install.packages("jsonlite")
}
#+end_src

**** data.table

=data.table= [fn:de30b846: http://cran.r-project.org/web/packages/data.table/index.html ]
is quite nice.

#+begin_src R
library(data.table)
#+end_src

#+begin_src R :noweb-ref rinstall-def
if(! require(data.table)) {
    install.packages("data.table")
}
#+end_src

**** xlsx

Read and write Excel files [fn:ed7756d2: http://cran.r-project.org/web/packages/xlsx/index.html].

#+begin_src R
library(xlsx)
#+end_src

#+begin_src R :noweb-ref rinstall-def
if(! require(xlsx)) {
    install.packages("xlsx")
}
#+end_src

**** XML

Make ℝ truly enterprise [fn:bf8a1f82: http://cran.r-project.org/web/packages/XML/index.html].

#+begin_src R
library(XML)
#+end_src

#+begin_src R :noweb-ref rinstall-def
if(! require(XML)) {
    install.packages("XML")
}
#+end_src

**** devtools

=devtools=: Tools to make developing ℝ code easier

#+begin_quote
[[http://cran.r-project.org/web/packages/devtools/index.html][Collection of package development tools]]
#+end_quote

That is a bit too terse. Intro to the README follows

#+begin_quote
The aim of devtools is to make your life as a package developer easier by providing R functions that simplify many common tasks. R packages are actually really simple, and with the right tools it should be easier to use the package structure than not. Package development in R can feel intimidating, but devtools does every thing it can to make it as welcoming as possible. devtools comes with a small guarantee: if because of a bug in devtools a member of R-core gets angry with you, I will send you a handwritten apology note. Just forward me the email and your address, and I'll get a card in the mail.
#+end_quote

Excellent.

[[http://cran.r-project.org/web/packages/devtools/README.html][Readme]]. [[http://cran.r-project.org/web/packages/devtools/devtools.pdf][Manual]]. [[https://github.com/hadley/devtools][Github]].

At the very least, just /know of/ this package, as you will be installing it if
you want to us =tidyr=.

#+begin_src R
library(devtools)
#+end_src

#+begin_src R :noweb-ref rinstall-def
if(! require(devtools)) {
    install.packages("devtools")
    devtools::install_github("hadley/devtools")
}

#+end_src

**** magrittr

This is a add from the /most understated package definition/ of the year
department. =magrittr= [fn:73ee53da: http://cran.r-project.org/web/packages/magrittr/index.html]
is, much like every Scheme library ever, deceptively simple in its power and
ease of use that it provides.

#+begin_src R
library(magrittr)
#+end_src

#+begin_src R :noweb-ref rinstall-def
if(! require(magrittr)) {
    devtools::install_github("smbache/magrittr")
}
#+end_src

**** reshape2

=reshape2=: Flexibly reshape data: a reboot of the =reshape= package

#+begin_quote
Reshape lets you flexibly restructure and aggregate data using just two functions: melt and cast.
#+end_quote

[[http://cran.r-project.org/web/packages/reshape2/index.html][CRAN]]. [[http://cran.r-project.org/web/packages/reshape2/reshape2.pdf][Manual]]. [[https://github.com/hadley/reshape/blob/master/README.md][Github]].

This seems to be a defacto standard.

#+begin_src R
library(reshape2)
#+end_src

#+begin_src R :noweb-ref rinstall-def
if(! require(reshape2)) {
    install.packages("reshape2")
}
#+end_src

**** tidyr

=tidyr=: Easily tidy data with spread and gather functions for ℝ

#+begin_quote
[[http://cran.r-project.org/web/packages/tidyr/index.html][tidyr]] is an evolution of reshape2. It's design specifically for data tidying (not general reshaping or aggregating) and works well with dplyr data pipelines.
#+end_quote

[[http://cran.r-project.org/web/packages/tidyr/README.html][Readme]]. [[http://cran.r-project.org/web/packages/tidyr/tidyr.pdf][Manual]]. [[https://github.com/hadley/tidyr][Github]].

Not on CRAN yet so install via

#+begin_src R
library(tidyr)
#+end_src

#+begin_src R :noweb-ref rinstall-def
if(! require(tidyr)) {
    devtools::install_github("hadley/tidyr")
}

#+end_src

