.Rprofile
## nil ends here
## [[file:~/git/bitbucket-grettke/home/TC3F.org::*sqldf][nil]]
library(sqldf)
## nil ends here
## [[file:~/git/bitbucket-grettke/home/TC3F.org::*MASS][nil]]
library(MASS)
## nil ends here
## [[file:~/git/bitbucket-grettke/home/TC3F.org::*jsonlite][nil]]
library(jsonlite)
## nil ends here
## [[file:~/git/bitbucket-grettke/home/TC3F.org::*data.table][nil]]
library(data.table)
## nil ends here
## [[file:~/git/bitbucket-grettke/home/TC3F.org::*xlsx][nil]]
library(xlsx)
## nil ends here
## [[file:~/git/bitbucket-grettke/home/TC3F.org::*XML][nil]]
library(XML)
## nil ends here
## [[file:~/git/bitbucket-grettke/home/TC3F.org::*magrittr][nil]]
library(magrittr)
## nil ends here
## [[file:~/git/bitbucket-grettke/home/TC3F.org::*devtools][nil]]
library(devtools)
## nil ends here
## [[file:~/git/bitbucket-grettke/home/TC3F.org::*reshape2][nil]]
library(reshape2)
