R.org
**** lubridate

lubridate: Make dealing with dates a little easier in ℝ

#+begin_quote
[[http://cran.r-project.org/web/packages/lubridate/index.html][Lubridate]] makes it easier to work with dates and times by providing functions to identify and parse date-time data, extract and modify components of a date-time (years, months, days, hours, minutes, and seconds), perform accurate math on date-times, handle time zones and Daylight Savings Time. Lubridate has a consistent, memorable syntax, that makes working with dates fun instead of frustrating.
#+end_quote

[[http://cran.r-project.org/web/packages/lubridate/lubridate.pdf][Manual]]. [[http://cran.r-project.org/web/packages/lubridate/vignettes/lubridate.html][Vignette]].

#+begin_src R
library(lubridate)
#+end_src

#+begin_src R :noweb-ref rinstall-def
if(! require(lubridate)) {
    install.packages("lubridate")
}
#+end_src

Perhaps in some /time/ there will be a unified approach to time-management among
all programming languages.

**** plyr

plyr: Tools for splitting, applying and combining data in R

#+begin_quote
[[http://cran.r-project.org/web/packages/plyr/index.html][plyr]] is a set of tools that solves a common set of problems: you need to break a big problem down into manageable pieces, operate on each pieces and then put all the pieces back together. For example, you might want to fit a model to each spatial location or time point in your study, summarise data by panels or collapse high-dimensional arrays to simpler summary statistics. The development of plyr has been generously supported by BD (Becton Dickinson).
#+end_quote

[[http://cran.r-project.org/web/packages/plyr/README.html][Readme]]. [[http://cran.r-project.org/web/packages/plyr/plyr.pdf][Manual]]. [[http://plyr.had.co.nz/][Home page]]. [[https://github.com/hadley/plyr][Github]].

#+begin_src R
library(plyr)
#+end_src

#+begin_src R :noweb-ref rinstall-def
if(! require(plyr)) {
    install.packages("plyr")
}
#+end_src

**** dplyr

dplyr: a grammar of data manipulation in R

The fact that I am loading both =plyr= and =dplyr= is something that I am
questioning. I do so because I learned them in that order, so left it that way.
However, this just results in *more* binding shadowing, and I am not sure of the
implications, and they are usually never good.

#+begin_quote
[[http://cran.r-project.org/web/packages/dplyr/index.html][A fast, consistent tool]] for working with data frame like objects, both in memory and out of memory.
#+end_quote

[[http://cran.r-project.org/web/packages/dplyr/README.html][Readme]]. [[http://cran.r-project.org/web/packages/dplyr/dplyr.pdf][Manual]]. [[http://cran.r-project.org/web/packages/dplyr/vignettes/introduction.html][Introduction to dplyr]].

#+begin_src R
library(dplyr)
#+end_src

#+begin_src R :noweb-ref rinstall-def
if(! require(dplyr)) {
    install.packages("dplyr")
}
#+end_src

**** testit

testit: A simple package for testing R packages

[[https://github.com/yihui/testit][GitHub]]. [[http://cran.rstudio.com/web/packages/testit/index.html][CRAN]]. [[http://cran.rstudio.com/web/packages/testit/testit.pdf][Manual]].

Gives you =assert= and =test_pkg=. Save characters.

#+begin_src R
library(testit)
#+end_src

#+begin_src R :noweb-ref rinstall-def
if(! require(testit)) {
    install.packages("testit")
}
#+end_src

**** markdown

- [[http://cran.r-project.org/web/packages/markdown/index.html][CRAN]]
  - [[http://cran.r-project.org/web/packages/markdown/markdown.pdf][reference]]
  - [[http://cran.r-project.org/web/packages/markdown/vignettes/markdown-examples.html][vignettes: markdown-examples]]
  - [[http://cran.r-project.org/web/packages/markdown/vignettes/markdown-output.html][vignettes: markdown-output]]
- [[https://github.com/rstudio/markdown][GitHub]]

#+begin_src R
library(markdown)
#+end_src

#+begin_src R :noweb-ref rinstall-def
if(! require(markdown)) {
    install.packages("markdown")
}
#+end_src

#+begin_quote
This package is referred to as R Markdown v1 when combined with knitr. The primary output format is HTML. Now we have introduced R Markdown v2, which is based on Pandoc and knitr, and supports much more types of output formats.
#+end_quote

**** knitr

knitr: A general-purpose package for dynamic report generation in R

Read the [[http://yihui.name/knitr/][home page]]. It has great resources.

Watched [[https://www.screenr.com/qcv8][the video]]. Very nice to see; comfortable and familiar. Need to set up
RStudio for it. Clearly a critical tool. Cites Knuth.

Features are amazingly understated. If you've worked with all of these tools,
you will appreciate the importance of the author's effort!

=Objects=, =Options=, =Hooks=, and =Patterns= … what is this, Emacs?

There are demo [[http://yihui.name/knitr/demos][links]]. There is a [[https://github.com/yihui/knitr-examples][project for examples]]. This [[http://yihui.name/knitr/demo/showcase/][showcase]] has links
to websites, book reviews, solutions, R packages, courses, workshops and
presentations, books, papers and reports, wrappers, and blog posts on =knitr=.

[[https://github.com/yihui/knitr][Here]] is the GitHub project. Read the motivations and see the hours and days and
weeks that you have had spared! Uses =testit=, so read up on that and added it.

Read the [[https://github.com/yihui/knitr/blob/master/FAQ.md][Frequently Asked Questions]]. Joined the [[https://groups.google.com/forum/#!forum/knitr][mailing list]]. =ess= supports it.
Sure that I can configure the custom prompt. Great =README=.

[[http://cran.r-project.org/web/packages/knitr/index.html][CRAN]] as expected. Much better summary eg HTML, Makrdown, reStructuredText, and
AsciiDoc are mentioned. Curious about the cacheing, and how I would do it in
=org=. Custom code to run before and after a hunk are another thoughtful touch one
would expect coming from =org=. Also support Python and shell. The LaTeX and LyX
support is also pretty neat. Same [[http://cran.r-project.org/web/packages/knitr/README.html][READM]]E. [[http://cran.r-project.org/web/packages/knitr/knitr.pdf][Reference]].

Somehow missed the [[http://cran.r-project.org/web/packages/knitr/vignettes/knitr-refcard.pdf][reference card]] initially.

[[http://yihui.name/knitr/demo/vignette/][How to build package vignettes with knitr]].

#+begin_src R
library(knitr)
#+end_src

#+begin_src R :noweb-ref rinstall-def
if(! require(knitr)) {
    install.packages("knitr")
}
#+end_src

**** slidify

- [[http://slidify.org/][HomePage]]
- No CRAN
- [[https://github.com/ramnathv/slidify][GitHub]]

#+begin_src R
library(slidify)
#+end_src

#+begin_src R :noweb-ref rinstall-def
if(! require(slidify)) {
    install_github("ramnathv/slidify")
    install_github("ramnathv/slidifyLibraries")
}
#+end_src

**** fortunes

R Fortunes.

[[http://cran.r-project.org/web/packages/fortunes/index.html][CRAN]].

#+begin_src R
library(fortunes)
#+end_src

#+begin_src R :noweb-ref rinstall-def
if(! require(fortunes)) {
    install.packages("fortunes")
}
#+end_src

**** ggplot2

- [[http://cran.r-project.org/web/packages/ggplot2/index.html][CRAN]]
  - [[http://cran.r-project.org/web/packages/ggplot2/ggplot2.pdf][reference]]
- [[https://github.com/hadley/ggplot2][Github]]
  - [[https://github.com/hadley/ggplot2/wiki][wiki]]
    - Lots of great resources
      - Whyu use it, how to support it, improvide i
      - Publications using it, around the web
      - FAQ, roadmap
    - Case studies
    - Tips and tricks
    - Enhancements
- [[https://groups.google.com/forum/#!forum/ggplot2][Mail list]]
- [[http://ggplot2.org/][Homepage]]
  - [[http://docs.ggplot2.org/current/][Documentation]]

#+begin_src R
library(ggplot2)
#+end_src

#+begin_src R :noweb-ref rinstall-def
if(! require(ggplot2)) {
    install.packages("ggplot2")
}
#+end_src

**** tikzDevice

- [[http://cran.r-project.org/web/packages/tikzDevice/index.html][CRAN]]
  - [[http://cran.r-project.org/web/packages/tikzDevice/tikzDevice.pdf][reference]]
  - [[http://cran.r-project.org/web/packages/tikzDevice/vignettes/tikzDevice.pdf][vignettes: tikzDevice]]
- [[https://github.com/yihui/tikzDevice][GitHub]]

#+begin_src R
library(tikzDevice)
#+end_src

#+begin_src R :noweb-ref rinstall-def
if(! require(tikzDevice)) {
    install.packages("tikzDevice")
}
#+end_src

**** ascii

- [[http://cran.r-project.org/web/packages/ascii/index.html][CRAN]]
  - [[http://cran.r-project.org/web/packages/ascii/ascii.pdf][reference]]
- [[https://github.com/eusebe/ascii/][GitHub]]

#+begin_src R
library(ascii)
#+end_src

#+begin_src R :noweb-ref rinstall-def
if(! require(ascii)) {
    install.packages("ascii")
}
#+end_src

Always display =org= representations; I'm assuming that it will be /the/ dominant
vehicle for analysis.

#+begin_src R
options(asciiType="org")
#+end_src

**** xtable

- [[http://cran.r-project.org/web/packages/xtable/index.html][CRAN]]
  - [[http://cran.r-project.org/web/packages/xtable/xtable.pdf][reference]]
  - [[http://cran.r-project.org/web/packages/xtable/vignettes/margintable.pdf][vignettes: margintable]]
  - [[http://cran.r-project.org/web/packages/xtable/vignettes/xtableGallery.pdf][vignettes: xtableGallery]]
- [[http://xtable.r-forge.r-project.org/][R-Forge]]

#+begin_src R
library(xtable)
#+end_src

#+begin_src R :noweb-ref rinstall-def
if(! require(xtable)) {
    install.packages("xtable")
}
#+end_src

**** Hmisc

- [[http://cran.r-project.org/web/packages/Hmisc/index.html][CRAN]]
  - [[http://cran.r-project.org/web/packages/Hmisc/Hmisc.pdf][reference]]
- [[https://github.com/harrelfe/Hmisc][GitHub]]

#+begin_src R
library(Hmisc)
#+end_src

#+begin_src R :noweb-ref rinstall-def
if(! require(Hmisc)) {
    install.packages("Hmisc")
}
#+end_src

**** log4r

- [[http://cran.r-project.org/web/packages/log4r/index.html][CRAN]]
  - [[http://cran.r-project.org/web/packages/log4r/log4r.pdf][reference]]
- [[https://github.com/johnmyleswhite/log4r][GitHub]]

#+begin_src R
library(log4r)
#+end_src

#+begin_src R :noweb-ref rinstall-def
if(! require(log4r)) {
    install.packages("log4r")
}
#+end_src

**** boot

- [[http://cran.r-project.org/web/packages/boot/index.html][CRAN]]
  - [[http://cran.r-project.org/web/packages/boot/boot.pdf][reference]]

#+begin_src R
library(boot)
#+end_src

#+begin_src R :noweb-ref rinstall-def
if(! require(boot)) {
    install.packages("boot")
}
#+end_src

**** kernlab

- [[http://cran.r-project.org/web/packages/kernlab/index.html][CRAN]]
  - [[http://cran.r-project.org/web/packages/kernlab/kernlab.pdf][reference]]
  - [[http://cran.r-project.org/web/packages/kernlab/vignettes/kernlab.pdf][vignettes: kernlab]]
- GitHub

#+begin_src R
library(kernlab)
#+end_src

#+begin_src R :noweb-ref rinstall-def
if(! require(kernlab)) {
    install.packages("kernlab")
}
#+end_src

