.Rprofile
## nil ends here
## [[file:~/git/bitbucket-grettke/home/TC3F.org::*tidyr][nil]]
library(tidyr)
## nil ends here
## [[file:~/git/bitbucket-grettke/home/TC3F.org::*lubridate][nil]]
library(lubridate)
## nil ends here
## [[file:~/git/bitbucket-grettke/home/TC3F.org::*plyr][nil]]
library(plyr)
## nil ends here
## [[file:~/git/bitbucket-grettke/home/TC3F.org::*dplyr][nil]]
library(dplyr)
## nil ends here
## [[file:~/git/bitbucket-grettke/home/TC3F.org::*testit][nil]]
library(testit)
## nil ends here
## [[file:~/git/bitbucket-grettke/home/TC3F.org::*markdown][nil]]
library(markdown)
## nil ends here
## [[file:~/git/bitbucket-grettke/home/TC3F.org::*knitr][nil]]
library(knitr)
## nil ends here
## [[file:~/git/bitbucket-grettke/home/TC3F.org::*slidify][nil]]
install_github("ramnathv/slidify")
install_github("ramnathv/slidifyLibraries")
## nil ends here
## [[file:~/git/bitbucket-grettke/home/TC3F.org::*slidify][nil]]
library(slidify)
## nil ends here
## [[file:~/git/bitbucket-grettke/home/TC3F.org::*fortunes][nil]]
library(fortunes)
## nil ends here
## [[file:~/git/bitbucket-grettke/home/TC3F.org::*ggplot2][nil]]
library(ggplot2)
## nil ends here
## [[file:~/git/bitbucket-grettke/home/TC3F.org::*tikzDevice][nil]]
library(tikzDevice)
## nil ends here
## [[file:~/git/bitbucket-grettke/home/TC3F.org::*ascii][nil]]
library(ascii)
## nil ends here
## [[file:~/git/bitbucket-grettke/home/TC3F.org::*ascii][nil]]
options(asciiType="org")
## nil ends here
## [[file:~/git/bitbucket-grettke/home/TC3F.org::*xtable][nil]]
library(xtable)
## nil ends here
## [[file:~/git/bitbucket-grettke/home/TC3F.org::*Hmisc][nil]]
library(Hmisc)
## nil ends here
## [[file:~/git/bitbucket-grettke/home/TC3F.org::*log4r][nil]]
library(log4r)
## nil ends here
## [[file:~/git/bitbucket-grettke/home/TC3F.org::*boot][nil]]
library(boot)
## nil ends here
## [[file:~/git/bitbucket-grettke/home/TC3F.org::*kernlab][nil]]
library(kernlab)
