R.org
**** Not explicitly loaded, but interesting packages

- [[http://projecttemplate.net/index.html][ProjectTemplate]]
- [[http://cran.r-project.org/web/packages/evaluate/index.html][evaluate]]
- [[http://cran.r-project.org/web/packages/yaml/index.html][yaml]]
- [[http://cran.r-project.org/web/packages/whisker/index.html][whisker]]
- [[http://cran.r-project.org/web/packages/formatR/index.html][formatR]]
- General caching [fn:452e6ab4: https://stackoverflow.com/questions/7262485/options-for-caching-memoization-hashing-in-r]
- [[http://cran.r-project.org/web/packages/stringi/index.html][stringi]]
  - [[http://www.r-bloggers.com/faster-easier-and-more-reliable-character-string-processing-with-stringi-0-3-1/?utm_source%3Dfeedburner&utm_medium%3Dfeed&utm_campaign%3DFeed%253A%2BRBloggers%2B%2528R%2Bbloggers%2529][Via]]
  - Seems focused on Unicode details
  - Why this instead of =stringr=?
- [[http://cran.r-project.org/web/packages/futile.options/index.html][futile.options: Futile options management]]
  - Referenced by the =settings= article
- [[http://cran.r-project.org/web/packages/settings/][settings: Software Option Settings Manager for R]]
  - [[http://www.r-bloggers.com/easy-to-use-option-settings-management-with-the-settings-package/?utm_source%3Dfeedburner&utm_medium%3Dfeed&utm_campaign%3DFeed%253A%2BRBloggers%2B%2528R%2Bbloggers%2529][Via]]
- [[https://github.com/craigcitro/r-travis][r-travis]]
  - [[http://www.r-bloggers.com/travis-ci-to-github-pages/?utm_source%3Dfeedburner&utm_medium%3Dfeed&utm_campaign%3DFeed%253A%2BRBloggers%2B%2528R%2Bbloggers%2529][Via]]
- [[https://github.com/MangoTheCat/testCoverage][testCoverage]]
  - [[http://www.r-statistics.com/2014/11/analyzing-coverage-of-r-unit-tests-in-packages-the-testcoverage-package/][Via]]
- [[http://cran.r-project.org/web/packages/xkcd/index.html][xkcd]]
  - [[http://www.exegetic.biz/blog/2014/11/creating-more-effective-graphs/?utm_source%3Drss&utm_medium%3Drss&utm_campaign%3Dcreating-more-effective-graphs][Via]]
- [[https://github.com/EconometricsBySimulation/Ninja/blob/master/2014/11/circ.graph.R][circ.graph.R]]
  - [[http://www.r-bloggers.com/make-your-own-hotly-criticised-circle-graph/?utm_source%3Dfeedburner&utm_medium%3Dfeed&utm_campaign%3DFeed%253A%2BRBloggers%2B%2528R%2Bbloggers%2529][Via]]
- [[https://github.com/yhat/pandasql][pandasql]]
  - [[http://www.r-bloggers.com/query-pandas-dataframe-with-sql/?utm_source%3Dfeedburner&utm_medium%3Dfeed&utm_campaign%3DFeed%253A%2BRBloggers%2B%2528R%2Bbloggers%2529][Via]]
- [[http://cran.r-project.org/web/packages/qdap/index.html][qdap: Bridging the Gap Between Qualitative Data and Quantitative Analysis]]
  - Glad to find this
  - [[http://www.r-bloggers.com/exploration-of-letter-make-up-of-english-words/?utm_source%3Dfeedburner&utm_medium%3Dfeed&utm_campaign%3DFeed%253A%2BRBloggers%2B%2528R%2Bbloggers%2529][Via]]
- [[https://github.com/environmentalinformatics-marburg/Rsenal][Rsenal]]
  - [[http://www.r-bloggers.com/introducing-rsenal-magic-r-functions-for-things-various/?utm_source%3Dfeedburner&utm_medium%3Dfeed&utm_campaign%3DFeed%253A%2BRBloggers%2B%2528R%2Bbloggers%2529][Via]]
  - Wished I had this the ohther day
- [[https://rapporter.github.io/pander/][pander]]
  - [[http://www.r-bloggers.com/pander-0-5-0-the-next-generation-of-markdown-tables-in-r/?utm_source%3Dfeedburner&utm_medium%3Dfeed&utm_campaign%3DFeed%253A%2BRBloggers%2B%2528R%2Bbloggers%2529][Via]]
- [[http://deployr.revolutionanalytics.com/][DeployR]]
  - [[http://www.r-bloggers.com/integrate-r-into-applications-with-deployr-open/?utm_source%3Dfeedburner&utm_medium%3Dfeed&utm_campaign%3DFeed%253A%2BRBloggers%2B%2528R%2Bbloggers%2529][Via]]
- [[http://cran.r-project.org/web/packages/openssl/][openssl: Bindings to OpenSSL]]
  - [[http://www.r-bloggers.com/generating-secure-random-numbers-with-openssl/?utm_source%3Dfeedburner&utm_medium%3Dfeed&utm_campaign%3DFeed%253A%2BRBloggers%2B%2528R%2Bbloggers%2529][Via]]
- [[https://github.com/Bart6114/simmer][simmer]]
  - Again I would have had to have written this myself
  - [[http://www.r-bloggers.com/simmer-2-0-a-performance-boost-revised-syntax/?utm_source%3Dfeedburner&utm_medium%3Dfeed&utm_campaign%3DFeed%253A%2BRBloggers%2B%2528R%2Bbloggers%2529][Via]]
- [[http://cran.r-project.org/web/packages/checkpoint/index.html][checkpoint: Install Packages from Snapshots on the Checkpoint Server for Reproducibility]]
  - [[http://www.r-bloggers.com/introducing-the-reproducible-r-toolkit-and-the-checkpoint-package/?utm_source%3Dfeedburner&utm_medium%3Dfeed&utm_campaign%3DFeed%253A%2BRBloggers%2B%2528R%2Bbloggers%2529][Via]]
- [[http://cran.r-project.org/web/packages/miniCRAN/index.html][miniCRAN: Tools to create an internally consistent, mini version of CRAN with selected packages only]]
  - [[http://www.r-bloggers.com/introducing-minicran-an-r-package-to-create-a-private-cran-repository/?utm_source%3Dfeedburner&utm_medium%3Dfeed&utm_campaign%3DFeed%253A%2BRBloggers%2B%2528R%2Bbloggers%2529][Via]]
- [[http://reaktanz.de/?c%3Dhacking&s%3DroxyPackage][roxyPackage]]
  - [[http://www.r-bloggers.com/managing-r-package-dependencies/?utm_source%3Dfeedburner&utm_medium%3Dfeed&utm_campaign%3DFeed%253A%2BRBloggers%2B%2528R%2Bbloggers%2529][Via]]
- [[http://cran.r-project.org/web/packages/roxygen2/index.html][roxygen2: In-source documentation for R]]
  - =roxypackage= mentioend it
- [[http://cran.r-project.org/web/packages/archivist/index.html][archivist: Tools for storing, restoring and searching for R objects]]
  - [[http://www.r-bloggers.com/lazy-load-with-archivist/?utm_source%3Dfeedburner&utm_medium%3Dfeed&utm_campaign%3DFeed%253A%2BRBloggers%2B%2528R%2Bbloggers%2529][Via]]
- [[http://dirk.eddelbuettel.com/code/pkgkitten.html][pkgKitten]]
  - [[http://www.r-bloggers.com/pkgkitten-0-1-1-still-creating-r-packages-that-purr/?utm_source%3Dfeedburner&utm_medium%3Dfeed&utm_campaign%3DFeed%253A%2BRBloggers%2B%2528R%2Bbloggers%2529][Via]]
- [[https://ramnathv.github.io/rCharts/][rCharts]]
  - [[http://www.r-bloggers.com/interactive-visualizations-from-r-using-rcharts/?utm_source%3Dfeedburner&utm_medium%3Dfeed&utm_campaign%3DFeed%253A%2BRBloggers%2B%2528R%2Bbloggers%2529][Via]]
- [[https://github.com/dgrtwo/broom][broom: Convert statistical analysis objects from R into tidy format]]
  - [[http://www.r-bloggers.com/r-package-to-convert-statistical-analysis-objects-to-tidy-data-frames/?utm_source%3Dfeedburner&utm_medium%3Dfeed&utm_campaign%3DFeed%253A%2BRBloggers%2B%2528R%2Bbloggers%2529][Via]]
- [[http://mran.revolutionanalytics.com/packages/info/?igraph][igraph: Network analysis and visualization]]
  - Why did they link to MRAN?
  - Looks like a great tool for learning about graphcs
  - [[http://www.r-bloggers.com/a-look-at-the-igraph-package/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%253A+RBloggers+%2528R+bloggers%2529][Via]]

** .First
      :PROPERTIES:
      :noweb-ref: rfirst-defs
      :END:

Reading:
- [[http://stat.ethz.ch/R-manual/R-devel/library/base/html/Startup.html][Startup]] :: mandatory reading, the definitive source
- [[http://cran.r-project.org/doc/contrib/Lemon-kickstart/kr_first.html][Kickstarting R]] :: I just like this tutorial

- =attach= is a powerfuly convenient function. Sure, it can make you and your
  program go bonkers, but you know, it is worth it for the convenience. Joking
  aside, it has its place, so it should not go away completely. However, it ought
  not be used much, and if you do need to use it, the it should be really really
  obvious.
  - Eg: [fn:7ce54638: http://www.r-bloggers.com/to-attach-or-not-attach-that-is-the-question/]
#+begin_src R
gcr$attach.unsafe <- attach
gcr$attach <- function(...) {
    warning("NEVER USE ATTACH! Use `unsafe.attach` if you must.")
    attach.unsafe(...)
}
#+end_src

- =library= reports issues immediately, and by design, =require= does not… remind
  the useR that they /may/ want the former not the latter
  - Via [fn:84031d95: http://www.r-bloggers.com/library-vs-require-in-r/]
  - Just like everything else here, this is a /personal preference/ thing!
#+begin_src R
gcr$require <- function(...) {
    warning("Are you sure you wanted `require` instead of `library`?")
    base::require(...)
}
#+end_src

Sometimes you only want to list everything *but* functions [fn:7b11c35d: https://stackoverflow.com/questions/13094324/hiding-function-names-from-ls-results-to-find-a-variable-name-more-quickly]:
#+begin_src R
gcr$lsnofun <- function(name = parent.frame()) {
    obj <- ls(name = name)
    obj[!sapply(obj, function(x) is.function(get(x)))]
}
#+end_src

Make it really simple to specify how to handle errors in a given session:
#+begin_src R
gcr$recoveronerror <- function() {
    options(error=recover)
}

gcr$recoveronerroroff <- function() {
    options(error=NULL)
}
#+end_src

Make it really simple to specify how to handle warnings in a given session:
#+begin_src R
gcr$erroronwarn <- function() {
    options(warn=2)
}

gcr$erroronwarnoff <- function() {
    options(warn=0)
}
#+end_src

=sqldf= should always use =SQLite=.

#+begin_src R
options(sqldf.driver = "SQLite")
#+end_src

Save your fingers from having to type =head= the next =n= thousand times [fn:f9fcc455: https://stackoverflow.com/questions/13024167/how-to-make-head-be-applied-automatically-to-output] because I can't. =ess-rdired= and friends use the dataframe print function,
so I didn't make dataframes print using it.
#+begin_src R
gcr$printdf <- function(df) {
    if (nrow(df) > 10) {
        print(head(df, 5))
        cat("---\n")
        print(tail(df, 5))
    } else {
        print(df)
    }
}
#+end_src

Sometimes you want to see all of the data in a dataframe, and sometimes you
don't. Make it really easy to change whenever you feel like it.

#+begin_src R
gcr$printlen <- function(len=500) {
    options("max.print" = len)
}
#+end_src

When you've got =n=-thousand rows of data, make it easier to get a sample from it,
just make it specific and keep it simple.

#+begin_src R
gcr$hundred <- function(df, idx=0) {
    df[idx:(idx+100),]
}
#+end_src

** .Renviron
      :PROPERTIES:
      :noweb-ref: renviron-def
      :END:

Install all packages to my home directory [fn:daab690d: http://www.r-bloggers.com/installing-r-packages/]
- Call =.libPaths()= to verify
- The directory must exist otherwise ℝ will ignore it
  - Solution:
    - Manual for now
    - Unsure of best way to generalize it
#+begin_src sh
R_LIBS=~/.Rpackages
#+end_src

For the time being, GUI work will only be performed on OSX so utilize OSX's
renderer [91578029: http://emacs.1067599.n5.nabble.com/unable-to-start-device-X11-td330804.html].

That worked fine until I actually starting using that graphics device!

Then even though I was on OSX I *had* to switch to =X11=.

<2014-11-05 Wed>
That was probably a mistake. The folks on-list said that =quartz= should be super.
Perhaps the error was between the keyboard and the chair, so I am switching
back.

<2014-11-08 Sat>
When I us =ggplot= and quarts on this system, it blows up.

<2014-11-25 Tue>
Switched to the official CRAN R build, which works fine on OSX.

#+begin_src sh
R_INTERACTIVE_DEVICE=quartz
#+end_src

Explicitly state the timezone. This could be done either here or in the =.profile=.
I'm not totally sure where to put it. Because I am trying to do *everything* with,
I will put it here. Perhaps this should get set via =Sys.setenv= instead? I'll
leave it for now and fix it later if necessary. I did test this out with a call
to =Sys.time()= and it worked correctly.

#+begin_src sh
TZ=America/Chicago
#+end_src


