.Rprofile
## nil ends here
.First <- function() {
    gcr <- new.env()
    ## [[file:~/git/bitbucket-grettke/home/TC3F.org::*.First][nil]]
    gcr$attach.unsafe <- attach
    gcr$attach <- function(...) {
        warning("NEVER USE ATTACH! Use `unsafe.attach` if you must.")
        attach.unsafe(...)
    }
    ## nil ends here
    ## [[file:~/git/bitbucket-grettke/home/TC3F.org::*.First][nil]]
    gcr$require <- function(...) {
        warning("Are you sure you wanted `require` instead of `library`?")
        base::require(...)
    }
    ## nil ends here
    ## [[file:~/git/bitbucket-grettke/home/TC3F.org::*.First][nil]]
    gcr$lsnofun <- function(name = parent.frame()) {
        obj <- ls(name = name)
        obj[!sapply(obj, function(x) is.function(get(x)))]
    }
    ## nil ends here
    ## [[file:~/git/bitbucket-grettke/home/TC3F.org::*.First][nil]]
    gcr$recoveronerror <- function() {
        options(error=recover)
    }
    
    gcr$recoveronerroroff <- function() {
        options(error=NULL)
    }
    ## nil ends here
    ## [[file:~/git/bitbucket-grettke/home/TC3F.org::*.First][nil]]
    gcr$erroronwarn <- function() {
        options(warn=2)
    }
    
    gcr$erroronwarnoff <- function() {
        options(warn=0)
    }
    ## nil ends here
    ## [[file:~/git/bitbucket-grettke/home/TC3F.org::*.First][nil]]
    options(sqldf.driver = "SQLite")
    ## nil ends here
    ## [[file:~/git/bitbucket-grettke/home/TC3F.org::*.First][nil]]
    gcr$printdf <- function(df) {
        if (nrow(df) > 10) {
            print(head(df, 5))
            cat("---\n")
            print(tail(df, 5))
        } else {
            print(df)
        }
    }
    ## nil ends here
    ## [[file:~/git/bitbucket-grettke/home/TC3F.org::*.First][nil]]
    gcr$printlen <- function(len=500) {
        options("max.print" = len)
    }
    ## nil ends here
    ## [[file:~/git/bitbucket-grettke/home/TC3F.org::*.First][nil]]
    gcr$hundred <- function(df, idx=0) {
        df[idx:(idx+100),]
    }
    ## nil ends here
    base::attach(gcr, name="gcr", warn.conflicts=FALSE)
}
fortune()

## Control\ Files:1 ends here
